package javaprj.day05;

public class 배열3차원2 {

	public static void main(String[] args) {
		
		String[][][] 조명단 = {
			
			
			//0면 자바프로젝트 명단
			{
				{"손영석" , "황스일",  "장해든",  "이현겸" },
				{"이용찬", "박세인", "김태준", "고지연"},
				{"정철진" ,"엄진희"  ,"김민경", "여도현"},
				{"이정하" ,"나해수", "조아진", "장윤성"  },
				{"송주창", "김민정", "김재민",  "김건희" }
			}
			
			,

			//1면 프론트프로젝트 명단
			{
				{"김민정" , "황스일",  "고지연",  "이현겸"  },
				{"이용찬", "박세인", "김태준", "장해든"},
				{"정철진" ,"엄진희"  ,"김민경", "여도현"},
				{"이정하" ,"나해수", "조아진", "장윤성"  },
				{"송주창", "송영석", "김재민",  "김건희" }
			}
			
		};
	
				for(int i=0; i<2; i++) {
					System.out.println("");
					System.out.println("\n" + "<<" + (i+1) + "면>>");
					for(int j=0; j<5; j++) {
						System.out.println("\n"+ "<" + (j+1) + "행>");
						for(int k=0; k<4; k++) {
							System.out.print(조명단[i][j][k]);
						}
					}
				};
	}

}
